const special_ruby = {
  科学:"かがく",
  運転:"うんてん",
  近接戦闘:"きんせつせんとう",
  "芸術／製作":"げいじゅつせいさく",
  サバイバル:"さばいばる",
  射撃:"しゃげき",
  操縦:"そうじゅう",
  伝承:"でんしょう",
  言語:"げんご",
};

const skill_ruby = {
  威圧:"いあつ",
  言いくるめ:"いいくるめ",
  医学:"いがく",
  自動車:"じどうしゃ",
  応急手当:"おうきゅうてあて",
  オカルト:"おかると",
  隠密:"おんみつ",
  回避:"かいひ",
  鍵開け:"かぎあけ",
  鑑定:"かんてい",
  機械修理:"きかいしゅうり",
  聞き耳:"ききみみ",
  クトゥルフ神話:"くとぅるふしんわ",
  経理:"けいり",
  考古学:"こうこがく",
  コンピューター:"こんぴゅーたー",
  自然:"しぜん",
  重機械操作:"じゅうきかいそうさ",
  乗馬:"じょうば",
  信用:"しんよう",
  心理学:"しんりがく",
  人類学:"じんるいがく",
  水泳:"すいえい",
  精神分析:"せいしんぶんせき",
  説得:"せっとく",
  ダイビング:"だいびんぐ",
  跳躍:"ちょうやく",
  追跡:"ついせき",
  手さばき:"てさばき",
  電気修理:"でんきしゅうり",
  電子工学:"でんしこうがく",
  投擲:"とうてき",
  登攀:"とうはん",
  動物使い:"どうぶつづかい",
  読唇術:"どくしんじゅつ",
  図書館:"としょかん",
  ナビゲート:"なびげーと",
  爆破:"ばくは",
  ヒプノーシス:"ひぷのーしす",
  変装:"へんそう",
  砲:"ほう",
  法律:"ほうりつ",
  魅惑:"みわく",
  目星:"めぼし",
  歴史:"れきし",

  // 科学
  暗号学:"あんごうがく",
  化学:"かがく",
  気象学:"きしょうがく",
  工学:"こうがく",
  植物学:"しょくぶつがく",
  数学:"すうがく",
  生物学:"せいぶつがく",
  地質学:"ちしつがく",
  天文学:"てんもんがく",
  動物学:"どうぶつがく",
  物理学:"ぶつりがく",
  法医学:"ほういがく",
  薬学:"やくがく",

  // 近接戦闘
  斧:"おの",
  格闘:"かくとう",
  絞殺ひも:"こうさつひも",
  チェーンソー:"ちぇーんそー",
  刀剣:"とうけん",
  フレイル:"ふれいる",
  むち:"むち",
  槍:"やり",

  // 芸術／製作
  演劇:"えんげき",
  絵画:"かいが",
  写真術:"しゃしんじゅつ",
  文書偽造:"ぶんしょぎぞう",

  // 射撃
  火炎放射器:"かえんほうしゃき",
  拳銃:"けんじゅう",
  サブマシンガン:"さぶましんがん",
  重火器:"じゅうかき",
  マシンガン:"ましんがん",
  弓:"ゆみ",
  "ライフル／ショットガン":"らいふるしょっとがん",

  // 操縦
  航空機:"こうくうき",

  // 言語
  英語:"えいご",
  日本語:"にほんご",
  ラテン語:"らてんご",
  母国語:"ぼこくご"
};

function skill2ruby(skill) {
  if (skill.type !== "skill") {
    return skill.name;
  } else {
    const match = skill.name.match(/^(.+)\s*\(([^)]+)\)$/)
    if (match) {
      let skillname = match[2].trim()
      let specialization = match[1].trim()

      if (specialization in special_ruby) {
        specialization = special_ruby[specialization];
      }
      if (skillname in skill_ruby) {
        skillname = skill_ruby[skillname];
      }
      return specialization + skillname;
    } else {
      if (skill.name in skill_ruby) {
        return skill_ruby[skill.name];
      } else {
        return skill.name;
      }
    }
  }
}

export function japaneseSortByNameKey (a, b) {
  return skill2ruby(a)
    .normalize('NFD')
    .replace(/[\u0300-\u036f]/g, '')
    .toLocaleLowerCase()
    .localeCompare(
      skill2ruby(b)
      .normalize('NFD')
      .replace(/[\u0300-\u036f]/g, '')
      .toLocaleLowerCase()
    )
}
